OpenFOAM-v1806/tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    frontAndBack
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    topAndBottom
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    hot
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    cold
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
}


// ************************************************************************* //
